#+TITLE: BuyseTest: Assessing a treatment effect based on multiple outcomes using generalized pairwise comparisons
#+Author: Brice Ozenne, Julien Peron, ..., Marc Buyse

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(BuyseTest)
#+END_SRC

#+RESULTS:

* The formula interface

The =BuyseTest= function enable to specify the sequence of endpoints
to be considered, their type and the associated threshold of clinical
relevance using a formula interface. The left hand side of the formula
specifies the binary variable identifying the two treatment
groups. The right hand side of the formula specifies the endpoints by
order of priority, separated by a =+=. Each endpoint is wrap by a
character string indicating its type:
- =Binary(Toxicity)= indicates that the endpoint Toxicity is binary. Binary can be abreviated into B or Bin.
- =Continuous(Score)= indicates that the endpoint Score is continuous. Continuous can be abreviated into C or Cont.
- =TimeToEvent(time)= indicates that the endpoint Toxicity is a time to event. TimeToEvent can be abreviated into T or TTE.
Additional arguments like the threshold of clinical relevance or the
type of event (1 for observed event, 0 for censoring) can be added using a comma as a separtor:
- =TTE(time,1,status)= indicates that time is the endpoint, the
  threshold of clinical relevance is 1 (with the same unit as time),
  and that status indicates the type of event. 
Finally, a single additional variable can be added in the formula (unwrapped) to specify the strata. 

\bigskip

The =initFormula= function extract all the necessary 
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest:::initFormula(Treatment ~ B(var1) + C(var2, 10) + TTE(var3, 15, exa) + Gender)
#+END_SRC

#+RESULTS:
#+begin_example
$treatment
[1] "Treatment"

$type
[1] 1 2 3

$endpoint
[1] "var1" "var2" "var3"

$threshold
[1] NA 10 15

$censoring
[1] NA    NA    "exa"

$strata
[1] "Gender"
#+end_example

** Binary endpoints

Thresholds are not relevant for binary variables. This is why it is
not possible to specify them through the formula interface. 

\bigskip

Internally, since binary endpoints are treated as continuous endpoints,
any threshold strictly small than 1 and strictly greater than 0 would
be valid. However to avoid confusion with the continuous case, only
thresholds equaling 1/2 are accepted. Specifying =NA= is also possible;
in such case the threshold will be automatically converted to \(1/2\).

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest:::initThreshold(threshold = NA, type = 1, D = 1, endpoint = c("Y1"))
#+END_SRC

#+RESULTS:
: [1] 0.5

This is because if \(Y=1\) and \(X=0\) then \(|Y-X| \geq 1/2\) 
while if \(Y=X\) then \(|Y-X| \leq 1/2\).

** Continuous and time to event endpoints

Threshold for continuous endpoints must be strictly positive. Whenever
a threshold is set to 0, it will be automatically reassigned to \(10^{-12}\):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest:::initThreshold(threshold = 0, type = 2, D = 1, endpoint = c("Y1"))
#+END_SRC

#+RESULTS:
: [1] 1e-12

This ensure that when \(Y=1\) and \(X=1.01\) then
\(|Y-X| \geq \tau=10^{-12}\) while whenever \(Y=X\) then \(|Y-X| \leq \tau=10^{-12}\)

\bigskip

In addition, thresholds corresponding to the same endpoints must be
strictly decreasing. In particular, the software will not accept a
redondant pair (endpoint, threshold).


